FIO-tests-08-10-01-01-2021-AAAAA/Configs/Test-results/fio-results
read-4k-0: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
read-4k-1: (g=1): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=8
fio-3.16
Starting 2 processes
{
  "fio version" : "fio-3.16",
  "timestamp" : 1609488709,
  "timestamp_ms" : 1609488709032,
  "time" : "Fri Jan  1 08:11:49 2021",
  "global options" : {
    "ioengine" : "libaio",
    "size" : "1G",
    "direct" : "1",
    "runtime" : "30",
    "time_based" : "1",
    "filename" : "/data/fio.test.file"
  },
  "jobs" : [
    {
      "jobname" : "read-4k-0",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "1",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 755941376,
        "io_kbytes" : 738224,
        "bw_bytes" : 25197205,
        "bw" : 24606,
        "iops" : 6151.661611,
        "runtime" : 30001,
        "total_ios" : 184556,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 38560,
          "max" : 12769944,
          "mean" : 108688.946266,
          "stddev" : 138241.580790
        },
        "clat_ns" : {
          "min" : 2078,
          "max" : 9941308,
          "mean" : 51658.584327,
          "stddev" : 106789.386414,
          "percentile" : {
            "1.000000" : 2192,
            "5.000000" : 2224,
            "10.000000" : 2256,
            "20.000000" : 2256,
            "30.000000" : 2288,
            "40.000000" : 2320,
            "50.000000" : 2352,
            "60.000000" : 2448,
            "70.000000" : 119296,
            "80.000000" : 130560,
            "90.000000" : 173056,
            "95.000000" : 179200,
            "99.000000" : 218112,
            "99.500000" : 230400,
            "99.900000" : 313344,
            "99.950000" : 790528,
            "99.990000" : 4554752
          }
        },
        "lat_ns" : {
          "min" : 120161,
          "max" : 12774572,
          "mean" : 160913.777596,
          "stddev" : 154616.824623
        },
        "bw_min" : 14955,
        "bw_max" : 26153,
        "bw_agg" : 80.419134,
        "bw_mean" : 19787.932203,
        "bw_dev" : 1329.424764,
        "bw_samples" : 59,
        "iops_min" : 3738,
        "iops_max" : 6538,
        "iops_mean" : 4946.593220,
        "iops_stddev" : 332.357572,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 3.616667,
      "sys_cpu" : 69.466667,
      "ctx" : 60637,
      "majf" : 0,
      "minf" : 15,
      "iodepth_level" : {
        "1" : 100.000000,
        "2" : 0.000000,
        "4" : 0.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 67.976657,
        "10" : 0.177182,
        "20" : 0.072065,
        "50" : 0.017339,
        "100" : 0.037929,
        "250" : 31.434361,
        "500" : 0.224322,
        "750" : 0.010000,
        "1000" : 0.010000
      },
      "latency_ms" : {
        "2" : 0.014088,
        "4" : 0.016255,
        "10" : 0.013004,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 1,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    },
    {
      "jobname" : "read-4k-1",
      "groupid" : 1,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 61,
      "job options" : {
        "rw" : "read",
        "bs" : "4k",
        "iodepth" : "8",
        "numjobs" : "1"
      },
      "read" : {
        "io_bytes" : 1841676288,
        "io_kbytes" : 1798512,
        "bw_bytes" : 61387163,
        "bw" : 59948,
        "iops" : 14987.100430,
        "runtime" : 30001,
        "total_ios" : 449628,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 4273,
          "max" : 14055585,
          "mean" : 49762.355779,
          "stddev" : 99014.693008
        },
        "clat_ns" : {
          "min" : 89248,
          "max" : 15038159,
          "mean" : 482539.349275,
          "stddev" : 364577.609697,
          "percentile" : {
            "1.000000" : 90624,
            "5.000000" : 92672,
            "10.000000" : 191488,
            "20.000000" : 218112,
            "30.000000" : 317440,
            "40.000000" : 387072,
            "50.000000" : 468992,
            "60.000000" : 561152,
            "70.000000" : 585728,
            "80.000000" : 643072,
            "90.000000" : 774144,
            "95.000000" : 905216,
            "99.000000" : 1187840,
            "99.500000" : 1335296,
            "99.900000" : 4620288,
            "99.950000" : 7569408,
            "99.990000" : 11075584
          }
        },
        "lat_ns" : {
          "min" : 152752,
          "max" : 15043236,
          "mean" : 532705.476712,
          "stddev" : 361151.988124
        },
        "bw_min" : 47049,
        "bw_max" : 66160,
        "bw_agg" : 99.989228,
        "bw_mean" : 59941.542373,
        "bw_dev" : 6061.742763,
        "bw_samples" : 59,
        "iops_min" : 11762,
        "iops_max" : 16540,
        "iops_mean" : 14985.305085,
        "iops_stddev" : 1515.474072,
        "iops_samples" : 59
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "percentile" : {
            "1.000000" : 0,
            "5.000000" : 0,
            "10.000000" : 0,
            "20.000000" : 0,
            "30.000000" : 0,
            "40.000000" : 0,
            "50.000000" : 0,
            "60.000000" : 0,
            "70.000000" : 0,
            "80.000000" : 0,
            "90.000000" : 0,
            "95.000000" : 0,
            "99.000000" : 0,
            "99.500000" : 0,
            "99.900000" : 0,
            "99.950000" : 0,
            "99.990000" : 0
          }
        },
        "total_ios" : 0
      },
      "job_runtime" : 30000,
      "usr_cpu" : 5.500000,
      "sys_cpu" : 75.180000,
      "ctx" : 42620,
      "majf" : 0,
      "minf" : 21,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 0.100000,
        "8" : 99.998443,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 99.999778,
        "8" : 0.100000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 6.778715,
        "250" : 17.010062,
        "500" : 29.285988,
        "750" : 35.479774,
        "1000" : 8.328440
      },
      "latency_ms" : {
        "2" : 2.818997,
        "4" : 0.173032,
        "10" : 0.102529,
        "20" : 0.022463,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 8,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "vda",
      "read_ios" : 632105,
      "write_ios" : 1,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 99395,
      "write_ticks" : 0,
      "in_queue" : 400,
      "util" : 99.473133
    }
  ]
}

read-4k-0: (groupid=0, jobs=1): err= 0: pid=296: Fri Jan  1 08:11:49 2021
  read: IOPS=6151, BW=24.0MiB/s (25.2MB/s)(721MiB/30001msec)
    slat (usec): min=38, max=12769, avg=108.69, stdev=138.24
    clat (usec): min=2, max=9941, avg=51.66, stdev=106.79
     lat (usec): min=120, max=12774, avg=160.91, stdev=154.62
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    3], 60.00th=[    3],
     | 70.00th=[  120], 80.00th=[  131], 90.00th=[  174], 95.00th=[  180],
     | 99.00th=[  219], 99.50th=[  231], 99.90th=[  314], 99.95th=[  791],
     | 99.99th=[ 4555]
   bw (  KiB/s): min=14955, max=26153, per=80.42%, avg=19787.93, stdev=1329.42, samples=59
   iops        : min= 3738, max= 6538, avg=4946.59, stdev=332.36, samples=59
  lat (usec)   : 4=67.98%, 10=0.18%, 20=0.07%, 50=0.02%, 100=0.04%
  lat (usec)   : 250=31.43%, 500=0.22%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.01%
  cpu          : usr=3.62%, sys=69.47%, ctx=60637, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=184556,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
read-4k-1: (groupid=1, jobs=1): err= 0: pid=298: Fri Jan  1 08:11:49 2021
  read: IOPS=14.0k, BW=58.5MiB/s (61.4MB/s)(1756MiB/30001msec)
    slat (usec): min=4, max=14055, avg=49.76, stdev=99.01
    clat (usec): min=89, max=15038, avg=482.54, stdev=364.58
     lat (usec): min=152, max=15043, avg=532.71, stdev=361.15
    clat percentiles (usec):
     |  1.00th=[   91],  5.00th=[   93], 10.00th=[  192], 20.00th=[  219],
     | 30.00th=[  318], 40.00th=[  388], 50.00th=[  469], 60.00th=[  562],
     | 70.00th=[  586], 80.00th=[  644], 90.00th=[  775], 95.00th=[  906],
     | 99.00th=[ 1188], 99.50th=[ 1336], 99.90th=[ 4621], 99.95th=[ 7570],
     | 99.99th=[11076]
   bw (  KiB/s): min=47049, max=66160, per=99.99%, avg=59941.54, stdev=6061.74, samples=59
   iops        : min=11762, max=16540, avg=14985.31, stdev=1515.47, samples=59
  lat (usec)   : 100=6.78%, 250=17.01%, 500=29.29%, 750=35.48%, 1000=8.33%
  lat (msec)   : 2=2.82%, 4=0.17%, 10=0.10%, 20=0.02%
  cpu          : usr=5.50%, sys=75.18%, ctx=42620, majf=0, minf=21
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=449628,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=24.0MiB/s (25.2MB/s), 24.0MiB/s-24.0MiB/s (25.2MB/s-25.2MB/s), io=721MiB (756MB), run=30001-30001msec

Run status group 1 (all jobs):
   READ: bw=58.5MiB/s (61.4MB/s), 58.5MiB/s-58.5MiB/s (61.4MB/s-61.4MB/s), io=1756MiB (1842MB), run=30001-30001msec

Disk stats (read/write):
  vda: ios=632105/1, merge=0/0, ticks=99395/0, in_queue=400, util=99.47%